<a href="https://colab.research.google.com/github/anjuunni/Sample/blob/main/Naive_Bayes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving titanic.csv to titanic.csv

In [ ]:
df=pd.read_csv("titanic.csv")

In [ ]:
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [ ]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [ ]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [ ]:
target=df.Survived
input=df.drop(['Survived'],axis='columns')

In [ ]:
dummies=pd.get_dummies(input.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [ ]:
input=pd.concat([input,dummies],axis='columns')
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [ ]:
input.drop(['Sex'],axis='columns',inplace=True)

In [ ]:
input.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [ ]:
input.isna().any()

Pclass    False
Age        True
Fare      False
female    False
male      False
dtype: bool

In [ ]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
input.Age=input.Age.fillna(input.Age.mean())
input.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
X_train,X_test,y_train,y_test=train_test_split(input,target,test_size=0.2)

In [ ]:
len(X_train)

712

In [ ]:
len(X_test)

179

In [ ]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [ ]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [ ]:
model.score(X_test,y_test)

0.770949720670391

In [ ]:
X_test[:10]

     Pclass        Age      Fare  female  male
753       3  23.000000    7.8958       0     1
418       2  30.000000   13.0000       0     1
207       3  26.000000   18.7875       0     1
396       3  31.000000    7.8542       1     0
4         3  35.000000    8.0500       0     1
406       3  51.000000    7.7500       0     1
48        3  29.699118   21.6792       0     1
834       3  18.000000    8.3000       0     1
282       3  16.000000    9.5000       0     1
438       1  64.000000  263.0000       0     1

In [ ]:
y_test[:10]

753    0
418    0
207    1
396    0
4      0
406    0
48     0
834    0
282    0
438    0
Name: Survived, dtype: int64

In [ ]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 0, 0, 0, 0, 1])

In [ ]:
model.predict_proba(X_test[:10])

array([[9.90998982e-01, 9.00101801e-03],
       [9.80813779e-01, 1.91862214e-02],
       [9.91653877e-01, 8.34612319e-03],
       [7.27530112e-02, 9.27246989e-01],
       [9.92339009e-01, 7.66099126e-03],
       [9.92333533e-01, 7.66646659e-03],
       [9.91969830e-01, 8.03017034e-03],
       [9.90015873e-01, 9.98412710e-03],
       [9.89595985e-01, 1.04040149e-02],
       [9.69016082e-14, 1.00000000e+00]])